import { ExternalLink } from "../lib/components.tsx"

export const title = "興味・関心"
export const description = "ふぁぼんが興味・関心を持っている(主に学問的な)分野について"

export default data =>
    <main>
        <h1>興味・関心</h1>
        <h2>プログラミング・コンピュータ</h2>
        <p>コンピュータに関する各種理論から実際に動くソフトウェアの実装まで、レイヤの高低問わず興味あり。</p>
        <ul>
            <li>2014年、JavaScriptからプログラミングの道に入る</li>
            <li>故にもともとはweb系のオタク。今は……何者なんだろう……</li>
            <li><ExternalLink href="https://www.ruby-lang.org/ja/">Ruby</ExternalLink>, <ExternalLink href="https://www.typescriptlang.org">TypeScript</ExternalLink>, <ExternalLink href="https://crystal-lang.org">Crystal</ExternalLink></li>
            <li>CUI/シェルスクリプト/ワンライナー/シェル芸</li>
            <li><ExternalLink href="https://archlinux.org/">Arch Linux</ExternalLink></li>
            <li>コードゴルフ</li>
            <li>VS Code使い。たまにVimもいじる</li>
            <li><ExternalLink href="https://github.com/fabon-f/dotfiles">dotfiles</ExternalLink></li>
            <li>競プロはやっていない。始める機運がゼロではないが……</li>
        </ul>

        <h2>自然言語・外国語</h2>
        <p>母語は日本語。非母語はロシア語しかわからん。英語は平易な文章を読んだり聞いたりはできるが、文構造が複雑な文章を読解したりまともに書いたり話したりはできない。ラテン語、中国語(普通話)、アラビア語、ウズベク語などをかじっては投げ、かじっては投げて今に至る。</p>

        <h2>理系の諸学問(数学・自然科学・工学など)</h2>
        <p>数学は興味があるものの得意ではない。せめて数学科の1〜2年生レベルの解析学や集合・位相は基礎から厳密な定義と証明を追って丁寧にやりたいと思いつつ、手をつけられないでいる。たとえばデデキントカットのことをかっこいい必殺技だと思ってるレベル。や、正確に言うと、デデキントカット自体はたぶん理解できるが、そこからどう実数を構成するか知らない。あとフーリエ変換みたいな物理学・工学に必要な各種概念・理論も……</p>
        <p>同様に物理学も、せめて熱力学、解析力学、電磁気学、統計力学、(初歩の)量子力学、相対性理論あたりは丁寧に(以下同文)。</p>
        <p>化学は好きだが、どちらかというと物理学寄りの分野が特に好き。物理化学が大好きな一方、有機化学は嫌いではないにしろ苦手意識がある。</p>
        <p>生物学や地学は……興味関心や義務感が全くないわけではないが、高校範囲ですら一切何も分からないし、取っ掛かりが見つからず入門できないでいる。</p>
        <p>人文社会のオタクでもあるのでいわゆる学際的な分野も好きだと思われそうだが、実はそうでもなかったり……人類学とか人間の脳とか認知・心理とかにも正直あまり興味が持てずにここまで来てしまった。科学技術論はちょっと興味あるかも。</p>

        <h2>人文・社会</h2>
        <p>専門(?)は歴史学と旧ソ連地域研究。言語学、政治学、社会学に興味あり。哲学・思想も興味がないわけではない。あと、かなり倫理道徳の存在・正当性に懐疑的なので、そのあたりの考えを整理するためにメタ倫理学はやりたいと思っている。芸術論、心理学、文学、宗教学、法学、教育学などはあまり興味がないかもしれない……</p>

        <a href="/">トップへ</a>
    </main>
