import { ExternalLink } from "../lib/components.tsx"

export const title = "趣味"
export const description = "ふぁぼんの好きなことについて"

export default data =>
    <main>
        <h1>趣味、好きなこと</h1>

        <h2>ライトノベル、web小説</h2>
        <p>恋愛もの、ラブコメが好き。ラブコメはカクヨムがけっこう強いので、なろうに加えてそっちも漁っている。たとえば「継母の連れ子が元カノだった」はカクヨム発だし。量産型ラブコメだろうがテンプレを外してこようが全部好き。</p>
        <p>一方でハイファンタジーはあまり好まない。特に「なろう系」ファンタジーが苦手。小さい頃にハイファンやドラクエ的RPGを嗜まずベタ甘恋愛小説(有川浩とか)ばかり読んでたせいで「冒険や成り上がりよりも人間関係を!」となった説が濃厚。みんなが共有している「剣と魔法」「ギルド」「ジョブ」「モンスター」「ステータス」「ダンジョン」のようなテンプレの面白さを私が全く理解できないせいで、人よりこのジャンルを楽しむハードルが上がってしまっている。</p>
        <p>ただ、ファンタジーが全部無理というわけではない。テンプレ加点がなくても面白い作品、あるいはそもそもテンプレから外れた名作もある。たとえば「<ExternalLink href="https://ncode.syosetu.com/n8356ga/">サイレント・ウィッチ</ExternalLink>」とか「図書館の魔女」とかは好き。</p>
        <p>あと、「ロクでなし魔術講師と禁忌教典」みたいなハイファンタジーの学園ものはジャンルとしてかなり好き。</p>

        <h2>ノベルゲー、ノベルゲー音楽</h2>
        <p>中2か中3以来、YouTubeなどでエロゲソング漁ってたし、公式サイトの作品紹介やキャラ紹介を読んでたし、消滅したサイトはインターネットアーカイブまで漁ってたし、エロゲatwikiとかも読んでた。作品に手をつけたのは大学入ってからだったけど……(しかもプレイがめちゃくちゃ遅い)</p>
        <p>性嫌悪エロゲーマーなのでエロは別に求めてない。最近は多少克服したからエロシーンも普通に読めるようになってきたけど。</p>
        <p>エロゲソングのプレイリストは<ExternalLink href="https://github.com/fabon-f/playlist/blob/master/eroge.m3u8">GitHub</ExternalLink>に置いている。一応他のジャンルのプレイリストも同じリポジトリに置いているけど、大半がエロゲソング。もはやエロゲソングならなんでも好きなんじゃないかってレベル。</p>

        <h2>ミステリ</h2>
        <p>本格推理みたいなトリック・謎解き極振り作品が好き。ミステリ的にフェアなやつも好きだし、そうでなくても好き。</p>
        <p>ライトミステリも好き。ミステリとラノベと恋愛ものが好きなオタクがライトミステリ嫌いなわけがない。もっと増えろ。</p>
        <p>〈古典部〉シリーズ(氷菓)、好き。アニメも別に嫌いじゃないけど原作の方が好き。というか米澤穂信全体的に好き。「さよなら妖精」と〈ベルーフ〉シリーズの太刀洗万智さんめっちゃすき。</p>
        <p>「継母の連れ子が元カノだった」の紙城境介先生はガチのミステリファンで、昔の「ウィッチハント・カーテンコール 超歴史的殺人事件」も最近の「僕が答える君の謎解き 明神凛音は間違えない」もめちゃくちゃいい。前者は論理的な緻密さよりも発想の壮大さと謎解きシーンにかける作者の熱意を、後者は本格推理ばりの緻密な論理展開を楽しむ小説だと個人的に思ってる。</p>
        <p>ホームズよりもポワロ派。アガサ・クリスティは本当に天才。「そして誰もいなくなった」なんかオタク大好きクローズドサークルの源流だし、現代のミステリでも出てくる各種トリックもクリスティ発のがたくさんあるし。「オリエント急行の殺人」「アクロイド殺し」「そして誰もいなくなった」あたり特に天才。こういう「やられた!」って叫びたくなるトリックが鮮やかなミステリばっか好きになってしまう……</p>
        <p>同様の理由で綾辻行人とかも好き。ところで十角館の殺人のマンガ版があるって正気か???? あれ映像化どころかコミカライズすら不可能だと思ってたんだけど。</p>
        <p>「すべてがFになる」から始まるS&amp;Mシリーズ、めちゃくちゃ好き。ミステリ部分も好きだけど、犀川先生への憧れがめちゃくちゃある。どのキャラも「ぼくのかんがえたさいきょうのてんさいきゃら」になってないのでめちゃくちゃ信頼できる。これ読んで大学に行きたくなった。</p>

        <h2>きらら作品</h2>
        <p>きらら作品というのは、「まんがタイムきらら」とその系列誌に掲載されている作品、あるいはそのアニメなどのこと。</p>
        <p>昔からもっぱら小説ばかり読んでてマンガというメディアにあまり馴染みがないせいか、ほぼきらら作品しか読まない。どうもジャンプとかマガジンとかサンデーとかそういうのが苦手で……(進撃の巨人と鬼滅の刃と呪術廻戦とチェンソーマンとDr.STONEは10年後くらいに読むかもしれない)</p>
        <p>好きな作品は「ステラのまほう」(アニメもあるけど、これは原作を読んでください)と「恋する小惑星」(アニメ化済み)と「ぼっち・ざ・ろっく!」(今度アニメ化するらしい)</p>

        <h2>移動、おでかけ、旅行、駅メモ</h2>
        <p>鉄道、徒歩、フェリー、路線バスなどの公共交通機関が好き。飛行機も嫌いではない。長時間徒歩や長時間鈍行移動などの長時間耐久を好む。旅行も好きだが、旅行よりも移動の方が好きかもしれない。移動途中によく駅メモを嗜む。</p>

        <h2>その他</h2>

        <ul>
            <li>SF</li>
            <li>艦これ</li>
            <li>世界各地の料理を食べること(主に中東欧、旧ソ連各地、西アジア、南アジア、東南アジア、東アジア)</li>
            <li>
                アニメ(最近あまり見れてない……)
                <ul>
                    <li>ハイスクール・フリート (他のとこでとっくに上映終了した劇場版を見に横須賀に何回か行ったレベルで好き この「好き」は理屈じゃないの)</li>
                </ul>
            </li>
        </ul>

        <h2>Twitter</h2>
        <p>……「好きなもの」というか、単に中毒?</p>

        <a href="/">トップへ</a>
    </main>
